/**
 * Created by lior sapir on 20-Mar-16.
 */
(function() {
    var app = angular.module('hamus', []);
    app.controller('hamusController', function () {
        this.products = details;
    })

    var details = [
        {name:'איך לגדל חמוס',
        data: 'החמוס בעל גוף מוארך וגמיש, מצטיין בגמישות תנועתו. רגליו קצרות ובכל אחת מהן 5 אצבעות. אפרכסות האוזניים קצרות ומעוגלות. פרוותם של החמוסים לרוב צפופה ורכה. הפרווה משתנה בעונות השנה, כאשר במהלך החורף הופכת לבהירה, ארוכה ומלאה, בעוד שבקיץ נושרת הפרווה והופכת דוקרנית יותר, ולעתים נוצרות קרחות בגוף הח' +
        'מוסים, בעיקר בקצה הזנב. ישנם גוונים שונים לפרווה: חום, שחור, לבקן, בלונדיני ועוד. מאחר שהח' +
        'מוסים הם אוכלי בשר הם נדרשים למערכת שיניים בהתאם. מלתעותיהם מפותחות מאוד ומספר שיניהם 28-38.',images:"ham1.jpg"
        },
        {name:'משפחת החמוסים',data: 'חמוסים הם חיית מחמד אידיאלית עבור אנשים שיש להם הזמן ונטיה לבהנה וקשר ט' +
        'וב עם בעלי חיים. חמוסים הם באופן טבעי שקטים, ידידותיים, סקרנים, אינטליגנטיים, וחברותיים. בנקוד' +
        'ות מסוימות ביום, הם גם פעילים מאוד ועלולים לעשות לצרות. האינטליגנציה שלהם הופכת אותם לבני לוויה מע' +
        'ניינת והם יכולים לשעשע את עצמם כשאתה לא בסביבה. אבל הם דורשים תשומת לב ואינטרא' +
        'קציה עם המגדל שלהם; הבריאות הנפשית ופיזית שלהם תלוי בזה.',images:"ham2.jpg"},
        {name:'חמוסים יפיפיים',data: 'Azurite',images:""}

    ];
})();